from pydantic import BaseModel


class Stories(BaseModel):
    id: int
    title: str
    description: str
    full_text: str


story_list = [
    Stories(
        id=1,
        title="Новогоднее чудо",
        description="Новогодние приключения друзей.",
        full_text="""
        В маленьком снежном городке, где каждый год встречали Новый год с радостью и весельем, жила девочка по имени Агата. Она обожала зиму, снег и, конечно же, праздники. Но в этом году что-то пошло не так. В преддверии Нового года олени, которые помогали Санте разносить подарки, заболели, и праздник оказался под угрозой.
        Агата, ее лучший друг Слава и их соседка София решили выяснить, что произошло..."""
    ),
    Stories(
        id=2,
        title="Спасение нового года",
        description="Новогодние приключения друзей.",
        full_text="""
        В маленьком городке, где зима всегда покрывала улицы белоснежным одеялом, жила девочка по имени София. Она с нетерпением ждала Новый год, ведь это было время волшебства, подарков и веселья. Но в этом году что-то было не так. Город выглядел мрачным, и ни одна елка не сверкала огнями. Все дети были грустными, ведь никто не знал, почему праздник не пришел...
        """
    )
]
